<!-- 
	用户须知
	author yjl
-->
<template>
	<view class="user-agreement">
		<view class="content">
			<view class="agreement">
				<!-- Aha口袋协议 -->
				<view class="title center">Aha 口袋用户协议</view>
欢迎您来到Aha口袋。

Aha口袋是杭州梵帝贸易有限公司提供的互联网产品服务。本用户协议是您与和Aha口袋平台关于您（以下简称“您”或“用户”）访问和使用Aha口袋产品和服务的主要协议。

您在使用Aha口袋产品和服务前，请认真阅读本协议的内容、充分理解各条款内容，如您不同意本服务协议及/或随时对其的修改，您可以主动停止使用Aha口袋提供的服务；您一旦使您勾选“我同意《Aha口袋服务协议》”并通过注册程序或其他任何方式使用或接受Aha口袋的任何服务，即视为您已阅读并同意本服务协议，自愿接受本服务协议的所有内容的约束。本协议即在您和Aha口袋之间产生法律效力。请您审慎阅读并选择接受或不接受协议。如果您未满18周岁，请在法定监护人的陪同下阅读本服务条款。

一、账号注册与使用:
1.用户按照页面给与的提示完成全部注册步骤后，即成为Aha口袋的用户，用户自行保管账号及密码，并准确、安全地使用其账号及密码。用户依据法律、法规、规章及规范性文件和本协议约定对所提供的信息承担相应的法律责任。
2.用户注册时应当向Aha口袋提供个人真实、有效的信息，信息包括但不限于账号名称、密码及补充、变更账号信息时输入的所有信息。同时，由于Aha口袋平台采用双用户制，对象类型为学生方与企业方，因此当您注册时应当提供您的手机号，邮件地址以及其他必要的信息以完成注册，若进行企业认证，应当提供您的统一社会信用代码及身份证等其他必要的信息以完成认证。您同意Aha口袋收集、存储、使用此类信息，用于身份验证、用户服务、安全防范等目的，以确保您良好的使用Aha口袋产品及相关功能。同时用户承诺：提供的所有个人信息、资料合法、真实、有效，用户依据法律、法规、规章及规范性文件和本协议约定对所提供的信息承担相应的法律责任。
3.用户有权登录Aha口袋，在限制范围内可善意修改用户申请注册时所提供信息，平台将及时、有效地为其提供该项服务。
4.用户发现其帐号或密码被他人非法使用或有使用异常情况的，应在得知或者应当得知侵权行为后三日内根据Aha口袋公布的联系方式通知平台，并有权请求平台采取措施暂停该帐号的登录和使用。平台根据用户身份核对结果，决定是否暂停用户帐号的登录和使用。

二、使用规则
1.用户在使用帐号期间，须遵守与互联网信息发布相关的法律、法规、规章、规范性文件及互联网一般道德和礼仪的规范与公序良俗，用户将自行对所发布的信息内容承担责任。用户发布的各类信息或利用Aha服务制作、上载、复制、发布、传播或者转载内容，不得包含以下内容：
1.1反对宪法所确定的基本原则的；1.2危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；1.3损害国家荣誉和利益的；1.4煽动民族仇恨、民族歧视，破坏民族团结的；1.5破坏国家宗教政策，宣扬邪教和封建迷信的；1.6散布谣言，扰乱社会秩序，破坏社会稳定的；1.7散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；1.8侮辱或者诽谤他人，侵害他人合法权益的；1.8侮辱或者诽谤他人，侵害他人合法权益的；
2.用户不得发送和储存任何带有病毒、蠕虫、木马和其他有害的计算机代码、文件、脚本和程序，不得实施危害计算机信息网络安全的行为。
3.用户不得对本服务任何部分或本服务之使用或获得，未经允许进行复制、拷贝、出售、转售或用于任何其它商业目的。
4.用户须对在Aha口袋上所传送信息的真实性、合法性、有效性等负责，与用户所传播的信息相关的任何法律责任由用户自行承担。用户通过Aha服务所传送的任何内容并不反映Aha的观点或政策，Aha口袋对此不承担责任。
5.用户充分了解并同意，Aha口袋为用户提供个性化信息服务，用户须为自己注册账号下的行为负责，包括用户所导入、上载、传送的任何内容以及由此产生的任何后果，用户应对Aha口袋中的内容自行加以判断，并承担因使用内容而引起的所有风险。Aha口袋不对因用户行为而导致的损失承担责任。
6. Aha口袋提供的服务中可能包含广告，用户同意在使用过程中显示Aha口袋和第三方供应商、合作伙伴提供的广告。用户因就第三方提供的服务、产品与第三方产生争议的，由用户与第三方自行解决。
7. Aha口袋保留因业务发展需要，单方面对其服务器所提供的全部或部分服务内容在任何时候不经任何通知的情况下变更、暂停、限制、终止或撤销服务的权利。
8. Aha口袋有权针对用户发表的内容进行审核，若用户实施违反本协议及法律法规的行为，Aha口袋平台有权视行为严重程度，根据《侵权责任法》《信息网络传播权保护条例》等法律法规要求用户立即采取纠正、改正、恢复原状、消除影响等行为，且Aha口袋有权自行采取合法有效且必要的措施（包括但不限于更改或删除相关侵权信息、暂停或终止用户使用本网络服务等），同时Aha口袋保留进一步追究用户法律责任的权利。
9．Aha口袋的资源板块有如下的特别规定：
1）资源板块原则上不对非认证为学生的甲方开放。
2）资源提供方需要签署与平台的知产合同。
3）资源兑换时可以使用Aha币与Aha点两种方式购买，Aha币购买时可以对资源贡献者产生贡献回馈。
4）对于匿名上传资源，Aha平台将开放资源简介等内容，等待资源所有者签署资源提供者协议并上传证明、通过审核后方才开放资源。

10. Aha外包板块有如下特别规定：
1）外包服务甲方乙方商讨好规则后，可以根据平台的合同生成模板或上传自定义合同进行条款更改和签章，合同甲方、乙方、平台方各持一份。
2）企业外包前需要提前交付订金以完成发包，匹配到合适的同学并完成项目后。平台会根据合同条款保证乙方对项目的运维责任，如若需要更换运维人员，需要额外提交需求，进行新的项目招募。
3）甲方乙方在平台对接下原则上只能使用平台账户交流。
三、个人隐私
Aha口袋充分尊重并保护所有使用服务用户的个人隐私权，高度重视用户的隐私及个人信息的保护，隐私保护条例帮助您了解我们收集哪些数据、为什么收集这些数据，会利用这些数据做些什么及如何保护这些数据。请在使用我们的产品（或服务）前，仔细阅读并了解《隐私权政策》。
四、知识产权
1.用户在Aha口袋上发表的全部内容（包括但不仅限于回答、评论等），平台可在合理范围内优先使用。Aha口袋根据代码相关排名、准确率等质量考核指标对用户进行奖励，同时若其他用户如需查看或下载代码将向平台支付费用，平台给与用户一定的奖励。
2.在Aha口袋上传或发表的内容，用户应保证该内容不会侵犯任何第三方的合法权益。如果第三方提出关于著作权的异议，Aha口袋有权根据实际情况删除相关的内容，且有权追究用户的法律责任。给Aha口袋或任何第三方造成损失的，用户应全额赔偿。
3. Aha口袋提供的技术、软件、程序、数据及其他信息（包括但不限于文字、图像、图片、照片、音频、视频、图表、色彩、版面设计、电子文档）的所有知识产权（包括但不限于版权、商标权、专利权、商业秘密）及相关权利Aha口袋有优先使用权，未经许可任何人不得擅自使用（包括但不限于复制、传播、展示、镜像、上载、下载、修改、出租等）。否则平台有权立即终止向用户提供产品和服务，并依法追究其知识产权侵权责任，要求用户赔偿Aha口袋的全部损失。
五、贡献点机制
贡献点为平台提供用于预览、解锁平台享有竞赛资源的方式。用户通过小程序注册并上传获得竞赛奖项的作品资料、相关证明，签署知识产权相关协议后等待审核，审核通过后，资源将会被投放在小程序平台中，并依据资源的完整性和所获奖项的等级，给予一定的贡献点奖励。贡献点值的获取将由本平台拟定，具体判断标准可见微信公众平台或小程序。对于匿名上传资源，将等待资源所有人认领并通过后台审核上线后匿名资源提供者与资源所有者方可获得相应贡献点。
贡献点机制最终解释权归属Aha口袋平台
六、侵权举报
1.受理范围：Aha口袋受理侵犯自然人、法人、非法人组织合法权益的侵权举报。发布内容中直接涉及侵权信息，如泄露个人姓名、家庭住址、身份证号码、工作单位、私人电话、知识产权等个人隐私或者造谣、诽谤行为或者侵犯知识产权以及违反本协议、国家法律法规政策等行为，Aha口袋有权根据侵犯个人隐私、造谣与诽谤、商业侵权等第三人、集体、国家利益的行为，对侵权人采取恢复原状、消除影响或终止服务的措施。
2.举报材料：用户在Aha口袋发表的内容仅表明其个人的立场和观点，并不代表Aha口袋的立场或观点。如果个人或单位发现Aha口袋上存在侵犯自身合法权益的内容，请立即与Aha口袋取得联系。为了保证问题能够及时有效地处理，请务必提交真实有效、完整清晰的材料。用户需提交以下资料，Aha口袋收到资料后开始办理侵权举报。
2.1提供举报人具体的联系方式。个人提供包括姓名、手机号码、身份证或护照复印件、通讯地址等信息，企业请提供加盖公章的营业执照复印件、通信地址、电话号码、电子邮箱等信息。2.2举报人充分、明确地描述侵权事实，并对自己受损利益做出描述，提供涉嫌侵权内容在Aha口袋上的具体页面地址，指明页面哪些侵权行为给权利人造成损失。2.3举报人提供举报内容真实性的声明
3.处理流程：Aha口袋收到举报后的二个工作日内开始处理，并在七工作日内处理完毕并给出回复，若最后一天如果是节假日,可以顺延。请用户保持联系方式的畅通，以便Aha口袋及时联系用户跟进事项进展。若侵权事实在Aha口袋已经删除或处理，但是百度、谷歌等搜索引擎依然可以搜索到的现象，是因为百度、谷歌等搜索引擎自带缓存，此类问题Aha口袋无权也无法处理。您可以自行联系搜索引擎服务商进行处理。
七、未成年人个人信息
1.若您是未成年人，建议您的监护人仔细阅读本协议的条款，并在征得您的监护人同意的前提下使用我们的产品和服务或向我们提供信息。
2.如您的监护人不同意您使用我们的服务或向我们提供信息，请您立即终止使用我们的服务并及时通知我们，以便我们采取相应的措施。
3.如果监护人发现我们在未获监护人同意的情况下收集了未成年人的个人信息，请监护人反馈联系我们，我们在核准相关情况后尽快删除您的个人数据。
八、免责声明
1. Aha口袋对平台进行停机维护、定期检查、更新软硬件、针对突发事件、不可抗力、电脑病毒、系统故障等因素导致的正常服务中断、中止，Aha口袋不承担责任，Aha口袋将尽力避免服务中断并将中断时间限制在最短时间内。用户因第三方如电信部门的通讯线路故障、技术问题、网络、电脑故障、系统不稳定性、突发事件、电脑病毒及其他各种不可抗力原因而遭受的损失，Aha口袋不承担责任。
2.因用户违反本协议或相关的服务条款的规定，导致或产生的任何第三方向Aha口袋主张的索赔，由用户承担。同时，用户在Aha口袋发表的观点及立场，并不代表Aha口袋的立场，用户应自行对发表内容负责，Aha口袋不承担任何法律及连带责任。
3.请客户自行妥善保管个人资料，将个人信息提供足够保障及备份，并采取适当的预防措施降低电脑病毒或其他恶意破坏性举动的风险，因保管不善造成账户被他人盗取，所有损失Aha口袋将不承担任何责任。
4.由于您的隐私权对本网站相当重要，除非有权机关依法调取或者约定，Aha口袋不会无故把您的个人信息提供给无关的第三方，但不对第三人恶意侵权导致信息泄露而产生的后果负责。
九、通知
1.您在注册成为Aha口袋用户，并接受Aha口袋服务时，您应向Aha口袋提供真实有效的联系方式（包括您的电子邮件、联系电话等），对于联系方式发生变更的，您有义务及时更新有关信息，并保持可被联系的状态。
2. Aha口袋将向您的上述联系方式的其中之一或其中若干向您送达各类通知。平台信息发送成功后即视为送达；以纸质载体发出的书面通知，按照提供联系地址交邮后的第五个自然日即视为送达。
十、修改和解释权
为了向用户及时、更好地提供产品和服务，基于对平台本身、用户及市场状况不断变化的考虑，在法律最大适用范围内，Aha口袋保留随时修改、新增、删除本协议条款的权利。修改、新增、删除本协议条款时，平台将于官方网站公告修改、新增、删除的事实，而不另行对用户进行个别通知。若用户不同意平台所修改、新增、删除的内容，可立即停止使用平台所提供的服务。若用户继续使用平台提供的服务，则视同用户同意并接受本协议条款修改、新增、删除后的内容，且不得因此而要求任何补偿或赔偿。
十一、法律适用及管辖
1.本协议之订立、生效、解释、修订、补充、终止、执行与争议解决均适用中华人民共和国法律；如法律无相关规定的，参照商业惯例或行业惯例。
2.因合同纠纷或财产性权益侵权纠纷，双方应尽量友好协商解决；协商不成时，用户和平台均有权将纠纷交由西湖区法院管辖。
3.本协议任一条款被视为废止、无效或不可执行，该条应视为可分的且并不影响本协议其余条款的有效性及可执行性。
十二、其他
1.本协议条款同样适用于您基于Aha口袋与第三方公司签订的全部线上线下合作协议及补充协议。
2．根据互联网的发展和有关法律、法规及规范性文件的变化，或者因业务发展需要，Aha口袋团队有权对本协议的条款作出修改或变更，一旦本协议的内容发生变动，Aha口袋将会直接在微信公众号、小程序上公布修改之后的协议内容，该公布行为视为Aha口袋已经通知用户修改内容。如果用户不同意Aha口袋对本协议相关条款所做的修改，用户有权并应当停止使用Aha口袋。如果用户继续使用Aha口袋，则视为用户接受Aha口袋对本协议相关条款所做的修改。
3. 如双方就本协议内容或其执行发生任何争议，双方应尽量友好协商解决；协商不成时，双方同意将争议提交至杭州仲裁委员会依据其规则仲裁解决。
4. 如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。
5. 本协议最终解释权归Aha口袋所有。
6. 若有任何疑问、建议、反馈、请与我们联系。
联系方式：微信号：Vcontinentloyal
地址：浙江省杭州市西湖区留和路288号养贤府三楼
邮政编码：310000
本协议最新更新时间：2021年02月03日

至此，您已经详细阅读并已理解本《Aha口袋用户协议》，并同意严格遵守本协议各条款和条件。
	
				<view style="text-align: end">生效日期：2020年2月3日</view>
				<!-- 隐私政策 -->
				<view class="title center">Aha口袋《隐私权政策》</view>
我们深知个人信息对您的重要性，并会尽全力保护您的个人信息安全可靠。我们致力于维持您对我们的信任，恪守以下原则，保护您的个人信息：权责一致原则、目的明确原则、选择同意原则、最少够用原则、确保安全原则、主体参与原则、公开透明原则等。同时，我们承诺，我们将按业界成熟的安全标准，采取相应的安全保护措施来保护您的个人信息。　　请在使用我们的产品（或服务）前，仔细阅读并了解本《隐私权政策》。
一、	我们如何收集和使用您的个人信息　　
个人信息是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。　　
我们仅会出于本政策所述的以下目的，收集和使用您的个人信息：
（一）为您提供网上信息服务　
1、注册　　
在您注册Aha口袋账户时，您需要提供手机号、短信验证码、微信信息、学生证、身份证用来判定是否为本人操作，除短信验证码外其他个人信息是使用该服务必要的基本身份信息。　
2、验证码登录、修改密码　　
在您登录时，若您选择验证码登录，您需要提供您的短信验证码信息，同时如果您忘记密码想要设置新密码，也需要您提供短信验证码信息，短信验证码只会被用来确认本人操作，我们不会记录以及用在他处。　
3、公告、作业、打卡功能和提醒短信　　
当您使用公告、作业、打卡发布信息或通过以上功能回复信息，您上传的文字、语音内容、图片、视频，以及对应的提醒短信内容，在我们的服务器上将存储60天，因为存储是实现这一功能所必须的。我们会以加密的方式存储，您也可以随时删除自己上传的内容，。除非经您自主选择或遵从相关法律法规要求，我们不会对外提供上述信息，或者将其用户该功能以外的其他用途。　
4、班级圈功能　　当您使用和校园班级圈功能时，您上传的班级圈照片、评论、点赞等信息会存储在我们的服务器中，因为存储是实现这一功能所必需的。我们会以加密的方式存储，您也可以随时删除这些信息。除非经您自主选择或遵从相关法律法规要求，我们不会对外提供上述班级圈信息，或者将其用于该功能以外的其他用途。　
5、语音输入　　您可以选择开启手机的麦克风权限，使用麦克风设备来进行语音输入，在使用过程中我们需要收集您的语音内容并进行必要的处理；如您不提供前述信息，我们将无法为您提供语音相关服务，但不影响您使用我们提供的其他服务。涉及语音输入的操作有聊天、发语音公告。　
6、图片上传　　当您使用图片上传功能时，您上传的图片信息会存储在我们的服务器中，因为存储是实现这一功能所必需的。我们会以加密的方式存储，您也可以随时删除自己上传的图片。除非经您自主选择或遵从相关法律法规要求，我们不会对外提供上述信息，或者将其用于该功能以外的其他用途。涉及图片上传的操作有聊天、发图文公告、上传相册、发班级圈。　
7、视频上传　　当您使用视频上传功能时，您上传的视频信息会存储在我们的服务器中，因为存储是实现这一功能所必需的。我们会以加密的方式存储，您也可以随时删除自己上传的视频。除非经您自主选择或遵从相关法律法规要求，我们不会对外提供上述信息，或者将其用于该功能以外的其他用途。涉及视频上传的操作有聊天、上传相册、发班级圈。　
8、位置信息　　当您使用消息功能发送位置信息、通过打卡功能发送位置打卡、使用图片选择器中的拍照功能和在线课程投屏功能时，我们会收集您收集的位置数据，这是使用这一功能所必须的。如您不提供前述信息，我们将无法为您提供位置信息相关服务，但不影响您使用我们提供的其他服务。　
9、视频会议　　当您使用视频会议功能进行在线会议时，APP需要访问您手机的通讯录的权限，才能确定那些号码可以参加视频会议，那些因为没装APP不能参加视频会议。如您不提供前述信息，我们将无法为您准确的用户参会提示，但不影响您使用我们提供的其他服务。　
10、礼品兑换　　您在积分商城兑换礼品之后，您需要提供您的手机号、姓名、详细的邮寄地址信息，如您不提供前述信息，我们可能无法成功发出礼品。　
11、客户服务　　我们会收集您使用和校园APP时的搜索记录、您与客户服务团队联系时提供的信息及您参与问卷调查时向我们发送的信息。如您不提供前述信息，不影响您使用我们提供的其他服务。　
12、第三方服务　　
在某些特定业务场景下，为了提高业务处理能力，提升相应速度或其他方面考虑，我们可能会使用有能力的第三方服务商提供的软件服务工具包（简称SDK）来为您提供服务。这些SDK可能会收集和使用您的个人信息，我们会在您授权同意后收集和使用。这些SDK包括：　　
（1）推送SDK:为了及时向您提供和校园消息服务通知，我们使用了消息PUSHSDK，这些SDK需要获取您的手机型号、系统类型、系统版本、设备屏幕尺寸参数用于实现APP推送服务。如您不希望收到这些通知或信息，可以再终端设置中关闭消息通知。　　
（2）百度SDK:为了为您提供位置发送服务、发送位置查看等与位置有关的服务，我们会使用百度SDK，以及您授权同意后获取本机位置权限。如不授权该权限将不能使用该功能。　　
（3）腾讯Bugly SDK:为了监控本客户端奔溃、页面异常问题，为您提供更好的服务，我们使用了腾讯的Bugly SDK,需要访问您设备当前的状态。　　
（4）分享SDK:为了便于您使用分享功能，我们使用了 Mobtech Sharesdk,需要访问您的设备标识、当前手机状态。　　
（5）一键登录SDK：为了便于您通过手机号码一键登录使用和校园APP，我们使用了中移互联网公司的一键登录SDK，需要访问您的手机号码、设备标识、当前手机状态。　　
·（6）云视讯SDK：为了便于您通过和校园APP进行电话会议，我们使用了云视讯SDK，需要访问您的设备标识、当前手机状态。　　
（7）腾讯云存储SDK：为了将您拍摄或录制的照片视频存储到有效服务器，我们使用了腾讯云SDK，需要访问您的设备标识、当前手机状态。　　
（8）友盟SDK：为了统计APP使用情况和用户行为习惯，我们使用了友盟SDK，需要访问您的设备标识、当前手机状态。　　
此外，第三方服务主体可能会通过和校园APP向您提供服务。当您进入第三方主体运营的服务页面时，请注意相关服务由第三方主体向您提供。涉及到第三方主体向您收集个人信息的，建议您仔细查看第三方主体的隐私政策或协议约定。　
13、其他　　
您提供的上述信息，将在您使用本服务期间持续授权我们使用。在您注销账号时，我们将停止使用并删除上述信息。　　　　
上述信息将存储于中华人民共和国境内。如需跨境传输，我们将会单独征得您的授权同意。　　请您理解，我们向您提供的服务是不断更新和发展的。如您选择使用了前述说明当中尚未涵盖的其他服务，基于该服务我们需要收集您的信息的，我们会通过页面提示、交互流程、协议约定的方式另行向您说明信息收集的范围与目的，并征得您的同意。我们会按照本政策以及相应的用户协议约定使用、存储、对外提供及保护您的信息；如您选择不提供前述信息，您可能无法使用某项或某部分服务，但不影响您使用我们提供的其他服务。

（二）开展内部数据分析和研究，统计服务，改善我们的产品或服务　　
我们收集数据是根据您与我们的互动和您所做出的选择，包括您的隐私设置以及您使用的产品和功能。我们收集的数据可能包括SDK/API/JS代码版本、浏览器、互联网服务提供商、IP地址、平台、时间戳、应用标识符、应用程序版本、应用分发渠道、独立设备标识符、iOS广告标识符（IDFA)、安卓广告主标识符、网卡（MAC）地址、国际移动设备识别码（IMEI）、设备型号、终端制造厂商、终端设备操作系统版本、会话启动/停止时间、语言所在地、时区和网络状态（WiFi等）、硬盘、CPU和电池使用情况等。　　
当我们要将信息用于本策略未载明的其它用途时，会事先征求您的同意。　　
当我们要将基于特定目的收集而来的信息用于其他目的时，会事先征求您的同意。

二、我们如何使用 Cookie 和同类技术
（一）Cookie　　
为确保网站正常运转，我们会在您的计算机或移动设备上存储名为 Cookie 的小数据文件。Cookie 通常包含标识符、站点名称以及一些号码和字符。借助于 Cookie，网站能够存储您的偏好或购物篮内的商品等数据。　　我们不会将 Cookie 用于本政策所述目的之外的任何用途。您可根据自己的偏好管理或删除 Cookie。您可以清除计算机上保存的所有 Cookie，大部分网络浏览器都设有阻止 Cookie 的功能。但如果您这么做，则需要在每一次访问我们的网站时亲自更改用户设置。如需详细了解如何更改浏览器设置，请访问以下链接：[Internet Explorer]、[Google Chrome]、[Mozilla Firefox][Safari] 和 [Opera]。
（二）网站信标和像素标签　　
除 Cookie 外，我们还会在网站上使用网站信标和像素标签等其他同类技术。例如，我们向您发送的电子邮件可能含有链接至我们网站内容的点击 URL。如果您点击该链接，我们则会跟踪此次点击，帮助我们了解您的产品或服务偏好并改善客户服务。网站信标通常是一种嵌入到网站或电子邮件中的透明图像。借助于电子邮件中的像素标签，我们能够获知电子邮件是否被打开。如果您不希望自己的活动以这种方式被追踪，则可以随时从我们的寄信名单中退订。
（三）Do Not Track（请勿追踪）　　
很多网络浏览器均设有 Do Not Track 功能，该功能可向网站发布 Do Not Track 请求。目前，主要互联网标准组织尚未设立相关政策来规定网站应如何应对此类请求。但如果您的浏览器启用了 Do Not Track，那么我们的所有网站都会尊重您的选择。

三、我们如何共享、转让、公开披露您的个人信息
（一）共享　　
我们不会向其他任何公司、组织和个人分享您的个人信息，但以下情况除外：　
1、在获取明确同意的情况下共享：获得您的明确同意后，我们会与其他方共享您的个人信息。　2、我们可能会根据法律法规规定，或按政府主管部门的强制性要求，对外共享您的个人信息。　3、与我们的关联公司共享：您的个人信息可能会与我们关联公司共享。我们只会共享必要的个人信息，且受本隐私政策中所声明目的的约束。关联公司如要改变个人信息的处理目的，将再次征求您的授权同意。我们的关联公司包括:河南校信通教育科技有限公司、河南智点科技有限公司　
4、与授权合作伙伴共享：仅为实现本隐私权政策中声明的目的，我们的某些服务将由授权合作伙伴提供。我们可能会与合作伙伴共享您的某些个人信息，以提供更好的客户服务和用户体验。例如，我们聘请来提供第三方数据统计和分析服务的公司可能需要采集和访问个人数据以进行数据统计和分析。在这种情况下，这些公司必须遵守我们的数据隐私和安全要求。我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。　　
对我们与之共享个人信息的公司、组织和个人，我们会与其签署严格的保密协定，要求他们按照我们的说明、本隐私政策以及其他任何相关的保密和安全措施来处理个人信息。
（二）转让　　
我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：　
1、在获取明确同意的情况下转让：获得您的明确同意后，我们会向其他方转让您的个人信息；　2、在涉及合并、收购或破产清算时，如涉及到个人信息转让，我们会在要求新的持有您个人信息的公司、组织继续受此隐私政策的约束，否则我们将要求该公司、组织重新向您征求授权同意。
（三）公开披露　　
我们仅会在以下情况下，公开披露您的个人信息：　
1、获得您明确同意后；　
2、基于法律的披露：在法律、法律程序、诉讼或政府主管部门强制性要求的情况下，我们可能会公开披露您的个人信息。

四、我们如何保护和保存您的个人信息
（一）我们如何保护您的个人信息　
1、我们已使用符合业界标准的安全防护措施保护您提供的个人信息，防止数据遭到未经授权访问、公开披露、使用、修改、损坏或丢失。我们会采取一切合理可行的措施，保护您的个人信息。例如，在您的浏览器与“服务”之间交换数据（如信用卡信息）时受 SSL 加密保护；我们同时对我们网站提供 https 安全浏览方式；我们会使用加密技术确保数据的保密性；我们会使用受信赖的保护机制防止数据遭到恶意攻击；我们会部署访问控制机制，确保只有授权人员才可访问个人信息；以及我们会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。　
2、我们会采取一切合理可行的措施，确保未收集无关的个人信息。我们只会在达成本政策所述目的所需的期限内保留您的个人信息，除非需要延长保留期或受到法律的允许。　
3、互联网并非绝对安全的环境，而且电子邮件、即时通讯、及与其他我们用户的交流方式并未加密，我们强烈建议您不要通过此类方式发送个人信息。请使用复杂密码，协助我们保证您的账号安全。　
4、互联网环境并非百分之百安全，我们将尽力确保或担保您发送给我们的任何信息的安全性。如果我们的物理、技术、或管理防护设施遭到破坏，导致信息被非授权访问、公开披露、篡改、或毁坏，导致您的合法权益受损，我们将承担相应的法律责任。　
5、在不幸发生个人信息安全事件后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。　　
同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。

（二）我们如何保存您的个人信息　
1、信息存储的地点　　
我们会按照法律法规规定，将境内搜集的用户个人信息存储于中国境内，不存在境外收集用户信息情况。　
2、信息存储的期限　　
我们承诺您的个人信息的存储时间始终处于合理必要期限内，我们根据业务需要时长去存储用户信息，超出保存期限的用户信息，校信通会做匿名化处理。当我们的产品和服务发生停止运营的情形时，我们以推送通知、公告形式通知您，并在合理的期限内删除您的个人信息或进行匿名化处理。　　
注：法律法规有规定不能删除时或不能匿名化处理的情况除外。

五、您的权利　　
按照中国相关的法律、法规、标准，以及其他国家、地区的通行做法，我们保障您对自己的个人信息行使以下权利：
（一）	访问您的个人信息　　
您有权访问您的个人信息，法律法规规定的例外情况除外。如果您想行使数据访问权，可以通过以下方式自行访问：　　
账户信息——如果您希望访问或编辑您的账户中的个人资料信息和支付信息、更改您的密码、添加安全信息或关闭您的账户等。　　
如果您无法通过上述链接访问这些个人信息，您可以进入微信社群：Aha口袋用户社群①并联系客服。我们将在10天内回复您的访问请求。　　
对于您在使用我们的产品或服务过程中产生的其他个人信息，只要我们不需要过多投入，我们会向您提供。如果您想行使数据访问权，请发送电子邮件至【1181348296@qq.com】。
（二）	更正您的个人信息　　
当您发现我们处理的关于您的个人信息有错误时，您有权要求我们做出更正。您可以通过
“（一）访问您的个人信息”中罗列的方式提出更正申请。　　
如果您无法通过上述链接更正这些个人信息，您可以进入微信社群：Aha口袋用户社群①并联系客服。我们将在10天内回复您的更正请求。
（三）	删除您的个人信息　　在以下情形中，您可以向我们提出删除个人信息的请求：　
1、如果我们处理个人信息的行为违反法律法规；　
2、如果我们收集、使用您的个人信息，却未征得您的同意；　
3、如果我们处理个人信息的行为违反了与您的约定；　
4、如果您不再使用我们的产品或服务，或您注销了账号；　
5、如果我们不再为您提供产品或服务。　　
若我们决定响应您的删除请求，我们还将同时通知从我们获得您的个人信息的实体，要求其及时删除，除非法律法规另有规定，或这些实体获得您的独立授权。　　
当您从我们的服务中删除信息后，我们可能不会立即备份系统中删除相应的信息，但会在备份更新时删除这些信息。
（四）	撤销已同意授权功能　　
客户端支持您撤销已有的授权，用户可在“手机设置—>权限”中关闭相关隐私权授权，具体为：　　Andriod手机：设置—>应用—>权限；　　
IOS手机：设置—>隐私—>权限—>应用；　　
当您撤销同意后，我们将不再处理相应的个人信息。但您撤销同意的决定，不会影响此前基于您的授权而开展的个人信息处理。　　
如果您不想接受我们给您发送的商业广告，您可以进入微信社群：Aha口袋用户社群①并联系客服。我们将在10天内回复您的访问请求。
（五）	个人信息主体注销账户　　
您随时可注销此前注册的账户，您可以进入微信社群：Aha口袋用户社群①并联系客服。我们将在10天内回复您的访问请求。　　
在注销账户之后，我们将停止为您提供产品或服务，并依据您的要求，删除您的个人信息，法律法规另有规定的除外。
（六）	个人信息主体获取个人信息副本　　
您有权获取您的个人信息副本，在技术可行的前提下，例如数据接口匹配，我们还可按您的要求，直接将您的个人信息副本传输给您指定的第三方。
（七）	约束信息系统自动决策　　
在某些业务功能中，我们可能仅依据信息系统、算法等在内的非人工自动决策机制做出决定。如果这些决定显著影响您的合法权益，您有权要求我们做出解释，我们也将提供适当的救济方式。
（八）	响应您的上述请求　　
为保障安全，您可能需要提供书面请求，或以其他方式证明您的身份。我们可能会先要求您验证自己的身份，然后再处理您的请求。我们将在10天内做出答复。对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情收取一定成本费用。对于那些无端重复、需要过多技术手段（例如，需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者非常不切实际（例如，涉及备份磁带上存放的信息）的请求，我们可能会予以拒绝。　　
在以下情形中，按照法律法规要求，我们将无法响应您的请求：　
1、与国家安全、国防安全有关的；　
2、与公共安全、公共卫生、重大公共利益有关的；　
3、与犯罪侦查、起诉和审判等有关的；　
4、有充分证据表明您存在主观恶意或滥用权利的；　
5、响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的。

六、我们如何处理儿童的个人信息　　
我们的产品、网站和服务主要面向成人。如果没有父母或监护人的同意，儿童不得创建自己的用户账户。　　
对于经父母同意而收集儿童个人信息的情况，我们只会在受到法律允许、父母或监护人明确同意或者保护儿童所必要的情况下使用或公开披露此信息。　　
尽管当地法律和习俗对儿童的定义不同，但我们将不满 14 周岁的任何人均视为儿童。　　
如果我们发现自己在未事先获得可证实的父母同意的情况下收集了儿童的个人信息，则会设法尽快删除相关数据。

七、您的个人信息如何在全球范围转移　　
原则上，我们在中华人民共和国境内收集和产生的个人信息，将存储在中华人民共和国境内。　　由于我们通过遍布全球的资源和服务器提供产品或服务，这意味着，在获得您的授权同意后，您的个人信息可能会被转移到您使用产品或服务所在国家/地区的境外管辖区，或者受到来自这些管辖区的访问。　　
此类管辖区可能设有不同的数据保护法，甚至未设立相关法律。在此类情况下，我们会确保您的个人信息得到在中华人民共和国境内足够同等的保护。例如，我们会请求您对跨境转移个人信息的同意，或者在跨境数据转移之前实施数据去标识化等安全举措。

八、本隐私权政策如何更新　　
我们可能适时会对本隐私权政策进行调整或变更，本隐私权政策的任何更新将以标注更新时间的方式公布在我们网站上，除法律法规或监管规定另有强制性规定外，经调整或变更的内容一经通知或公布后的7日后生效。如您在隐私权政策调整或变更后继续使用我们提供的任一服务或访问我们相关网站的，我们相信这代表您已充分阅读、理解并接受修改后的隐私权政策并受其约束。

九、如何联系我们　　
如果您对本隐私政策有任何疑问、意见或建议，或发生个人信息泄露、内容违规等情况需要投诉，可随时进入微信社群：Aha口袋用户社群①并联系客服或通过小程序端在线客服等方式与我们联系，我们会积极进行查证、处理并尽快答复，投诉类问题在48小时内给您答复，非投诉建议或意见将10天内形成处理意见给您反馈。　　

公司名称：杭州梵帝贸易有限公司
通过以下方式与我们联系：　　微信社群：Aha口袋用户社群①
			</view>
			<!-- 须知勾选 -->
			<view class="sign" @click="isReaded = !isReaded">
				<view class="square" :class="isReaded ? 'active' : ''">{{ isReaded ? '&#10003' : '' }}</view>
				<view class="small">
					我已阅读
					<text class="strong">Aha口袋</text>
					<text>《用户协议》</text>
					<text>和《隐私权政策》</text>
				</view>
			</view>
			<!-- 完成按键 -->
			<button 
				class="readed-btn" 
				:class="isReaded ? 'already' : 'noReady'" 
				@click="onclickRead">
				我已阅读
			</button>
		</view>
		<!-- 加载动画 -->
		<load-animation ref="loading"></load-animation>
	</view>
</template>

<script>
import { signNotice } from '@/static/request/api_system.js'
export default {
	data() {
		return {
			isReaded: getApp().globalData.gUserInfo.signedNotice
		}
	},
	methods: {
	   /**
		* 点击已阅读，判断是否勾选了用户协议，未勾选则跳过，勾选则触发请求
		*/
		onclickRead() 
		{
			if (!this.isReaded){
				return
			}
			if(getApp().globalData.gUserInfo.signedNotice){
				this.$emit("readed")
				return
			}
			/* 触发请求 */
			this.gLoading(this, true)
			signNotice()
			.then(res => {
				uni.setStorageSync('token', res.data)
				this.gToastMsg("签署成功")
				getApp().globalData.gUserInfo.signedNotice = true
				this.$emit('readed')
			})
			.finally(() => this.gLoading(this, false))
		}
	}
}
</script>

<style lang="stylus" scoped>
.user-agreement
	z-index 15
	position fixed
	top 0
	left 0
	height 100vh
	width 100vw
	background-color rgba(144, 140, 139, 0.65)
	.content
		position absolute
		top 45%
		left 50%
		transform translate(-50%, -50%)
		width 90%
		height 80vh
		padding 10px
		background-color #FFFFFF
		color #333333
		border-radius 10px
		box-shadow var(--shadow1)
		display flex
		flex-direction column
		.title
			font-size 28rpx
			font-weight 700
		/* 协议内容 */
		.agreement
			margin 5px 0
			flex 1
			padding 5px
			font-size 22rpx
			white-space pre-wrap
			overflow-y auto
		/* 勾选协议 */
		.sign
			padding-top 5px
			display flex
			align-items center
			justify-content center
			.square
				margin 5px
				width 32rpx
				height 32rpx
				border 1px solid #333333
				display flex
				align-items center
				justify-content center
				&.active
					border-color var(--origin2)
					color var(--origin2)
			.strong
				color var(--origin2)
		/* 已阅读按键 */
		.readed-btn
			margin-top 10px
			width 100%
			padding 0
			background-color rgba(144, 140, 139, 0.65)
			color #333333
			&.noReady:active
				transform none
			&.already
				background-color var(--origin2)
				color #FFFFFF
</style>
